#!/bin/bash
set -euo pipefail

# --------------------------------------------------------------------------------------
# BEGIN GRN
# -e 表示计算空间导数
grt greenfn -Mmilrow -D2/0 -N1500/0.02 -OGRN -R30 -e
# END GRN
# --------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------
# BEGIN SYN DC
# -e 计算空间导数，-I1 得到阶跃源响应，-D 卷积上升 0.5 s、下降 1.5 s 的非对称余弦波
grt syn -GGRN/milrow_2_0_30 -S1e24 -A30 -M33/50/120 -Osyn_dc -e -I1 -Dc/0.5/1.5
# END SYN DC
# --------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------
# BEGIN ZNE
# -N 表示输出ZNE分量
grt syn -GGRN/milrow_2_0_30 -S1e24 -A30 -M33/50/120 -Osyn_dc_zne -e -N -I1 -Dc/0.5/1.5
# END ZNE
# --------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------
# BEGIN STRAIN 
# 指定文件夹，会在原文件夹内输出SAC格式的应变张量
grt strain -Gsyn_dc_zne
# END STRAIN
# --------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------
# BEGIN ROTATION 
# 指定文件夹，会在原文件夹内输出SAC格式的旋转张量
grt rotation -Gsyn_dc_zne
# END ROTATION
# --------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------
# BEGIN STRESS 
# 指定文件夹，会在原文件夹内输出SAC格式的应力张量
grt stress -Gsyn_dc_zne
# END STRESS
# --------------------------------------------------------------------------------------

# BEGIN SPROJ
# 接收断层形态与震源机制独立设置
grt sproj -Gsyn_dc_zne -M90/60/0
# END SPROJ

# BEGIN COULOMB
grt coulomb -Gsyn_dc_zne -F0.4
# END COULOMB

python run.py

python plot.py

# 打包本页文档、输入文件、脚本和运行结果
rm -f *.tar.gz
example=$(basename "$PWD")
tar -czf "../${example}.tar.gz" -C .. "$example"
mv "../${example}.tar.gz" "${example}.tar.gz"

# 打包后删除计算结果，节省本地空间
rm -rf GRN syn_dc syn_dc_zne
