# -----------------------------------------------------------------------------------
# START BUILD MODEL
import pygrt

# 直接使用模型文件路径
pymod = pygrt.PyModel1D(modelpath="milrow")

# END BUILD MODEL
# -----------------------------------------------------------------------------------


# -----------------------------------------------------------------------------------
# BEGIN GRN
from obspy import read

pymod = pygrt.PyModel1D(grn="GRN", modelpath="milrow")

# 结果写入 GRN/milrow_{depsrc}_{deprcv}_{dist}/
pymod.greenfn(depsrc=2.0, deprcv=0.0, dists=[5, 8, 10], nt=500, dt=0.02)
# END GRN
# -----------------------------------------------------------------------------------

# ----------------------------------------------------------------------
# BEGIN READ GRN
# 需要时再显式读回；多震中距时需指定子目录，单震中距可用 GRN/*/*.sac
stgrn = read("GRN/milrow_2_0_5/*.sac")

print(stgrn)
# 15 Trace(s) in Stream:
# .SYN..EXZ | 1970-01-01T00:00:00.000000Z - 1970-01-01T00:00:09.980000Z | 50.0 Hz, 500 samples
# .SYN..VFZ | 1970-01-01T00:00:00.000000Z - 1970-01-01T00:00:09.980000Z | 50.0 Hz, 500 samples
# ...
# END READ GRN
# ----------------------------------------------------------------------
